tutorialsDyM/FallingSphereMorphing/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         Gauss linear;
    div(phi.b,U.b)      Gauss limitedLinearV 1;
    div(phi.a,U.a)      Gauss limitedLinearV 1;
    div(phi,k)      Gauss limitedLinear 1;;
    div(phi,epsilon) Gauss limitedLinear 1;;
    div(phi,R)      Gauss limitedLinear 1;;
    div(R)          Gauss limitedLinear 1;;
    div(phi,omega)  Gauss limitedLinear 1;
        div(phir,alpha)  Gauss limitedLinear 1;
                div(phi,alpha)  Gauss limitedLinear 1;
    div(phid,p_rbgh)     Gauss limitedLinear 1;
        div(phia,pa_new_value)     Gauss limitedLinear 1;
    div(phi,K)      Gauss limitedLinear 1;

    div(phi,e)      Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected ;
}

oversetInterpolation
{
    method          inverseDistance;
}

fluxRequired
{
    default         no;
    pcorr           ;
    p_rbgh               ;
}


// ************************************************************************* //
